{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Text file containing summaries of all main frontend components and pages.",
  "frontend/index.css": "Tailwind CSS setup defining global OKLCH color variables and theme modes.",
  "frontend/index.html": "Base HTML file mounting the React app at #root and loading main.tsx.",
  "frontend/src/App.tsx": "App entry configuring TanStack Router routes and theme provider.",
  "frontend/src/components/Footer.tsx": "Footer with about text, quick links, social icons, and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Top navigation bar with branding, auth actions, theme toggle, and responsive menu.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hook managing Internet Identity authentication lifecycle.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks providing placeholder backend data operations.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/src/main.tsx": "Renders the React app root, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Displays the user's dashboard with mock metrics, weak areas, daily plan, and recent activity using various UI cards and icons.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero section, feature list, and Internet Identity login redirecting authenticated users to the dashboard.",
  "frontend/src/pages/MockTests.tsx": "Shows mock test listings, filters by company, and displays recent attempts with performance stats.",
  "frontend/src/pages/Onboarding.tsx": "Two-step onboarding form collecting user details and target companies, then navigating to the dashboard.",
  "frontend/src/pages/Profile.tsx": "Profile settings page allowing users to edit personal and preference data with a summary card and form controls.",
  "frontend/src/pages/Progress.tsx": "Renders the Progress Analytics page with summary cards and multiple charts visualizing study time, category distribution, readiness history, and topic confidence.",
  "frontend/src/pages/StudyLog.tsx": "Implements the Study Log page with a form to record study sessions and a tabbed view showing recent session history.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, and container settings for the frontend UI.",
  "project_state.json": "Defines the project’s current state, including goals, architecture notes, and pending feature requests for the Placement Prep Tracker."
}